# 14. 그룹화
: 동일한 값을 가진 것들끼리 합쳐서 기초통계량 계산 위해 사용

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   45  40  35      PYTHON
8번    윤대협  능남고  190  100   85   90  95  95          C#

In [2]:
df.groupby('학교')

In [3]:
# 그룹을 짓고 북산고 그룹만 가져오기
df.groupby('학교').get_group('북산고')

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85      Python
2번    정대만  북산고  184  40  35   50  55  25        Java
3번    송태섭  북산고  168  80  75   70  80  75  Javascript
4번    서태웅  북산고  187  40  60   70  75  80         NaN
5번    강백호  북산고  188  15  20   10  35  10         NaN

In [4]:
df.groupby('학교').mean()   # 계산 가능한 데이터들의 평균값

              키         국어         영어         수학         과학    사회
학교
능남고  193.333333  78.333333  83.333333  76.666667  73.333333  70.0
북산고  184.800000  53.000000  55.000000  60.000000  68.000000  55.0

In [5]:
df.groupby('학교').size() # 각 그룹의 크기 정보

학교
능남고    3
북산고    5
dtype: int64

In [6]:
df.groupby('학교').size()['능남고']   # 학교 그룹화 이후 능남고에 해당하는 데이터의 수

3

In [7]:
df.groupby('학교')['키'].mean()   # 학교 그룹화 이후 키의 평균 데이터

학교
능남고    193.333333
북산고    184.800000
Name: 키, dtype: float64

- 어떤 특정 obs 불러올때는 맨 마지막에 붙고, 어떤 특정 변수에 대해 알아볼떄는 함수 전에

In [8]:
df.groupby('학교')[['국어','영어','수학']].mean() 
# 여러개니까 [] 안에 한번 더 []로 lIst로 !

            국어         영어         수학
학교
능남고  78.333333  83.333333  76.666667
북산고  53.000000  55.000000  60.000000

In [9]:
# 학년이라는 새 변수 추가
df['학년'] = [3,3,2,1,1,3,2,2]
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기  학년
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python   3
2번    정대만  북산고  184   40   35   50  55  25        Java   3
3번    송태섭  북산고  168   80   75   70  80  75  Javascript   2
4번    서태웅  북산고  187   40   60   70  75  80         NaN   1
5번    강백호  북산고  188   15   20   10  35  10         NaN   1
6번    변덕규  능남고  202   80  100   95  85  80           C   3
7번    황태산  능남고  188   55   65   45  40  35      PYTHON   2
8번    윤대협  능남고  190  100   85   90  95  95          C#   2

In [12]:
df['학년'].dtypes    # 숫자형

dtype('int64')

### 여러 변수에 대해 그룹화

In [13]:
df.groupby(['학교', '학년']).mean()  # 학교별,학년별 평균 데이터

            키    국어     영어    수학    과학    사회
학교  학년
능남고 2   189.0  77.5   75.0  67.5  67.5  65.0
    3   202.0  80.0  100.0  95.0  85.0  80.0
북산고 1   187.5  27.5   40.0  40.0  55.0  45.0
    2   168.0  80.0   75.0  70.0  80.0  75.0
    3   190.5  65.0   60.0  75.0  75.0  55.0

- summary 같은거없나 ? 저런 요약에 각 셀 해당 데이터 수도 같이 나오는

In [14]:
df.groupby('학년').mean()

             키         국어         영어         수학         과학         사회
학년
1   187.500000  27.500000  40.000000  40.000000  55.000000  45.000000
2   182.000000  78.333333  75.000000  68.333333  71.666667  68.333333
3   194.333333  70.000000  73.333333  81.666667  78.333333  63.333333

In [15]:
df.groupby('학년').mean().sort_values('키')
# 학년별로 키 평균값 내고 큰 키 순서로 오름차순 정렬

             키         국어         영어         수학         과학         사회
학년
2   182.000000  78.333333  75.000000  68.333333  71.666667  68.333333
1   187.500000  27.500000  40.000000  40.000000  55.000000  45.000000
3   194.333333  70.000000  73.333333  81.666667  78.333333  63.333333

In [16]:
df.groupby(['학교','학년']).sum()

          키   국어   영어   수학   과학   사회
학교  학년
능남고 2   378  155  150  135  135  130
    3   202   80  100   95   85   80
북산고 1   375   55   80   80  110   90
    2   168   80   75   70   80   75
    3   381  130  120  150  150  110

In [20]:
df.groupby('학교')[['이름','SW특기']].count()    
# 학교로 그룹화 한 뒤 학교별 SW특기 데이터의 수
# 북산고 두 명은 SW특기가 NaN 이라 카운트에서 제외됨

     이름  SW특기
학교
능남고   3     3
북산고   5     3

- size() 와는 또 다름.

In [23]:
school = df.groupby('학교')
school['학년'].value_counts()   # 학교 그룹화 이후 학년별 학생 수

학교   학년
능남고  2     2
     3     1
북산고  1     2
     3     2
     2     1
Name: 학년, dtype: int64

In [24]:
school['학년'].value_counts().loc['북산고']   # 위 정보의 북산고만

학년
1    2
3    2
2    1
Name: 학년, dtype: int64

In [26]:
# 비율. normalize = True
school['학년'].value_counts(normalize = True).loc['북산고']
# 북산고 학생들의 학년 비율로 가져옴

학년
1    0.4
3    0.4
2    0.2
Name: 학년, dtype: float64